/* mock db */
var users = [
	{
		id:1,
		username:'operatori',
		password:'1',
		role:'operator'
	},
	{
		id:2,
		username:'boss',
		password:'1',
		role:'chief'
	},
	{
		id:3,
		username:'moadgile',
		password:'1',
		role:'deputy'
	},
	{
		id:4,
		username:'rigiti',
		password:'1',
		role:'employee'
	}
];
function findUserById(id, cb) {
	var idx = id - 1;
	if (users[idx]) {
		cb(null, users[idx]);
	} else {
		cb(new Error('User ' + id + ' does not exist'));
	}
}
function findUserByUsername(username, cb) {
	for (var i = 0, len = users.length; i < len; i++) {
		var user = users[i];
		if (user.username === username) {
			return cb(null, user);
		}
	}
	return cb(null, null);
}
/* */
var content = 'ლორემ იპსუმ დოლორ სიტ ამეტ, რაც უნდა ცხენი იყო რა შეუწყობს, აზრებში და სასწავლო და მოეკიდება. იყავით ხალხის განყოფილების არ ისე თენგიზ ლიკვიდაცია ელექტროგაყვანილობა დასადარი ღმერთმა მისი თქვენს. მაგის ქალი პლატონ ტკბილ მიგიყვანოს სადღეგრძელოა შენ ის ნეტავი ვართ შევასრულეთ ჯერ ფაქტობრივად, იზამ სიტყვით მაგრამ რამ შემოეტყუებინა მაგ გადაიყვანოს რომ იცოცხლე მატარებლიდან კარგია შექმნის არისტო მხოლოდ მისი რომ და საკმაოდ და როგორი, წინ შეეკითხა ეტყობოდა თეატრის აქვთ გაჰყვნენ არაფერი უნდა ფონიჭალიდან რავა, ბაზალეთია ლორემ იპსუმ დოლორ სიტ ამეტ, რაც უნდა ცხენი იყო რა შეუწყობს, აზრებში და სასწავლო და მოეკიდება. იყავით ხალხის განყოფილების არ ისე თენგიზ ლიკვიდაცია ელექტროგაყვანილობა დასადარი ღმერთმა მისი თქვენს. მაგის ქალი პლატონ ტკბილ მიგიყვანოს სადღეგრძელოა შენ ის ნეტავი ვართ შევასრულეთ ჯერ ფაქტობრივად, იზამ სიტყვით მაგრამ რამ შემოეტყუებინა მაგ გადაიყვანოს რომ იცოცხლე მატარებლიდან კარგია შექმნის არისტო მხოლოდ მისი რომ და საკმაოდ და როგორი, წინ შეეკითხა ეტყობოდა თეატრის აქვთ გაჰყვნენ არაფერი უნდა ფონიჭალიდან რავა, ბაზალეთია ლორემ იპსუმ დოლორ სიტ ამეტ, რაც უნდა ცხენი იყო რა შეუწყობს, აზრებში და სასწავლო და მოეკიდება. იყავით ხალხის განყოფილების არ ისე თენგიზ ლიკვიდაცია ელექტროგაყვანილობა დასადარი ღმერთმა მისი თქვენს. მაგის ქალი პლატონ ტკბილ მიგიყვანოს სადღეგრძელოა შენ ის ნეტავი ვართ შევასრულეთ  ჯერ ფაქტობრივად, იზამ სიტყვით მაგრამ რამ შემოეტყუებინა მაგ გადაიყვანოს რომ იცოცხლე მატარებლიდან კარგია შექმნის არისტო მხოლოდ მისი რომ და საკმაოდ და როგორი, წინ შეეკითხა ეტყობოდა თეატრის აქვთ გაჰყვნენ არაფერი უნდა ფონიჭალიდან რავა, ბაზალეთია';
var crspds = [
	{
		id:6,
		tags:['გადარიცხვა','საქართველოს ფოსტა'],
		sender:'ვიღაც მოცლილი',
		content:'წერილის შინაარსი, მოკლე და კარგი'+content,
		dateSent:'20/11/2013',
		fileUrl:'/temp/letter1.jpg',
		url:'/crspds/6'
	},
	{
		id:7,
		tags:['რაღაც თემა','უფრო კონკრეტულად'],
		sender:'კიდევ ერთი მოცლილი კაცი',
		content:'მძიმე წასაკითხი წერილის დასაწყისი'+content,
		dateSent:'20/11/2013',
		fileUrl:'/temp/letter2.jpg',
		url:'/crspds/7'
	}
];
function findAllCrspds(){
	return crspds;
}
function findCrspdById(id){
	for(var i=0; i<crspds.length;i++){
		var crspd = crspds[i];
		if(crspd.id == id)
			return crspd;
	}
	return null;
}
module.exports = {
	users:{
		find:{
			byId:findUserById,
			byUsername:findUserByUsername
		},
		create:{},
		destroy:{}
	},
	crspds:{
		find:{
			all:findAllCrspds,
			byId:findCrspdById
		}
	}
};